import os
from pathlib import Path

# === File Paths ===
PROJECT_ROOT = Path(__file__).resolve().parent.parent
DATA_DIR =  PROJECT_ROOT /  "data"
OUTPUT_DIR = PROJECT_ROOT /  "result"

DATA_DIR.mkdir(parents=True, exist_ok=True)
OUTPUT_DIR.mkdir(parents=True, exist_ok=True)


DICT_FILE_PATH = DATA_DIR / "myg2p_mypos.dict" # FIXMED - NOT USE

PARTICLES = ['ကို', 'က', 'မှ', 'မှာ', 'ထဲမှာ', 'ထဲက', 'နဲ့', 'ရဲ့', 'နှင့်', 'တွင်', 'အား', 'သာ',
             'လောက်', 'ပဲ', 'မိန့်', 'ကြ', 'လား', 'တယ်', 'မယ်', 'သည်','မလား', 'လည်း', 'ပါ', 'နော်', 'ခင်ဗျာ', 
             'ဗျာ', 'ရှင်', 'ဖြစ်ပြီး', 'ပြီးတော့', 'နောက်ပြီး', 'ပြီးနောက်', 'ကြောင့်', 'အတွက်', 'ဆိုတော့', 'လို့', 'ဖြစ်လို့', 'တဲ့အတွက်', 
             'ပေမဲ့', 'သော်လည်း', 'ရင်', 'ပါက', 'လျှင်', 'ဖို့', 'ဖို့အတွက်']
SUFFIXES = ['များ', 'တွေ', 'လေး', 'ကောင်', 'သား', 'ခြား', 'နဲ့', 'ရဲ့', 'မှ', 'သာ', 'ပဲ', 'ကြိမ်', 'ဦး', 
            "ပြည်နယ်", "ခရိုင်", "မြို့နယ်", "မြို့", "ရပ်ကွက်", "ရပ်", "ရွာ", "ကျေးရွာ"]
PREFIXES = ["တိုင်း", "တိုင်းဒေသကြီး","နေပြည်တော်"]

CLAUSE_MARKERS = ['နောက်ပြီး', 'ပြီးနောက်', 'ဖို့အတွက်', 'ဖြစ်ပြီး', 'ပြီးတော့', 'ဖြစ်လို့', 'တဲ့အတွက်', 'သော်လည်း', 'ကြောင့်', 'ဆိုတော့', 'ပေမယ့်', 'အတွက်', 'ပေမဲ့', 'လျှင်', 'လို့', 'ဖို့', 'ရင်', 'ပါက']










